# SetDiagramSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..SetDiagramSettings Method
AnalysisDisplayStyle Class See Also
---
Set diagram settings object for the style.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void SetDiagramSettings(
	AnalysisDisplayDiagramSettings diagramSettings
)
```

Visual Basic
---
```text
Public Sub SetDiagramSettings ( _
	diagramSettings As AnalysisDisplayDiagramSettings _
)
```

Visual C++
---
```text
public:
void SetDiagramSettings(
	AnalysisDisplayDiagramSettings^ diagramSettings
)
```

# ### Parameters
diagramSettings
    Type: Autodesk.Revit.DB.Analysis..::..AnalysisDisplayDiagramSettings
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | diagram settings were not created with the object. |

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace